#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
```

Success! The configuration is valid.


```
</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

google_project_iam_member.secret_accessor: Refreshing state... [id=test-project-miguel/roles/secretmanager.secretAccessor/serviceAccount:test-project-miguel@appspot.gserviceaccount.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloudfunctions_function.pull_request_summary will be created
  + resource "google_cloudfunctions_function" "pull_request_summary" {
      + available_memory_mb           = 256
      + description                   = "Summarizes pull requests for a given GitHub repository."
      + docker_registry               = (known after apply)
      + effective_labels              = (known after apply)
      + entry_point                   = "pull_requests_summary"
      + environment_variables         = {
          + "EMAIL_FROM" = "notifications@example.com"
          + "EMAIL_TO"   = "developer@example.com"
        }
      + https_trigger_security_level  = "SECURE_ALWAYS"
      + https_trigger_url             = (known after apply)
      + id                            = (known after apply)
      + ingress_settings              = "ALLOW_ALL"
      + max_instances                 = 1
      + name                          = "pull-request-summary"
      + project                       = "test-project-miguel"
      + region                        = "us-central1"
      + runtime                       = "python312"
      + service_account_email         = (known after apply)
      + status                        = (known after apply)
      + terraform_labels              = (known after apply)
      + timeout                       = 200
      + trigger_http                  = true
      + version_id                    = (known after apply)
      + vpc_connector_egress_settings = (known after apply)

      + secret_environment_variables {
          + key        = "GITHUB_TOKEN"
          + project_id = (known after apply)
          + secret     = "github-token"
          + version    = "1"
        }

      + source_repository {
          + deployed_url = (known after apply)
          + url          = "https://source.developers.google.com/projects/test-project-miguel/repos/github_miguelortize_github-weekly-report/moveable-aliases/main/paths/python_functions/github_weekly_report"
        }

      + timeouts {
          + create = "150s"
          + delete = "150s"
          + update = "150s"
        }
    }

  # google_cloudfunctions_function_iam_member.public_invoker will be created
  + resource "google_cloudfunctions_function_iam_member" "public_invoker" {
      + cloud_function = "pull-request-summary"
      + etag           = (known after apply)
      + id             = (known after apply)
      + member         = "allUsers"
      + project        = "test-project-miguel"
      + region         = "us-central1"
      + role           = "roles/cloudfunctions.invoker"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + https_trigger_url = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @miguelortize, Action: `pull_request`, Working Directory: `./terraform`, Workflow: `Terraform`*